app/controllers/api/v1/areas_controller.rb

SELECT `areas`.* FROM `areas`
SELECT `areas`.* FROM `areas` ORDER BY `areas`.`id` DESC LIMIT 5
SELECT COUNT(*) FROM `areas`
---
  def index
    puts "Params Limit: #{params[:_limit]}".magenta
    @areas = Area.all

    limit = params[:_limit]

    if limit.present?
      limit = limit.to_i
      @areas = @areas.last(limit)
    end
    puts "@Areas count: #{@areas.count}".cyan

INSERT INTO `areas` (`name`, `description`, `frequency`, `days_since_completed`, `assigned_to`, `assigned_to_email`, `notes`, `status`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2022-12-09 00:31:53.883771', '2022-12-09 00:31:53.883771')
---
  def create
    puts "Area Create: #{area_params}".magenta
    @area = Area.new(area_params)

    if @area.save

UPDATE `areas` SET `areas`.`status` = '0', `areas`.`updated_at` = '2022-12-09 03:44:12.206876' WHERE `areas`.`id` = 7
---
  def update
    if @area.update(area_params)

DELETE FROM `areas` WHERE `areas`.`id` = 2
---
  def destroy
    @area.destroy

SELECT `areas`.* FROM `areas` WHERE `areas`.`id` = 2 LIMIT 1
---
    def set_area
      @area = Area.find(params[:id])