app/controllers/api/v1/todos_controller.rb

  def index
    puts "Params Limit: #{params[:_limit]}".magenta
    @todos = Todo.all

    limit = params[:_limit]

    if limit.present?
      limit = limit.to_i
      @todos = @todos.last(limit)
    end
    puts "@Todos count: #{@todos.count}".cyan
---
SELECT `todos`.* FROM `todos`
SELECT "todos".* FROM "todos" ORDER BY "todos"."id" DESC LIMIT ?  [["LIMIT", 5]]
SELECT COUNT(*) FROM `todos`

  def create
    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["completed", 0], ["created_at", "2022-11-27 18:16:37.960507"], ["updated_at", "2022-11-27 18:16:37.960507"]]

  def update
    if @todo.update(todo_params)
---
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2022-11-26 22:57:37.571795"], ["id", 1]]